tests/ChannelAMI/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        // Name of new patch
        name cyc1;

        // Dictionary to construct new patch from
        patchInfo
        {
            type cyclicAMI;
            neighbourPatch  cyc2;
            transform       translational;
            separationVector (0 0 1);
            matchTolerance  1e-4;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;
        patches (auto0);
    }

    {
        // Name of new patch
        name cyc2;

        // Dictionary to construct new patch from
        patchInfo
        {
            type cyclicAMI;
            neighbourPatch  cyc1;
            transform       translational;
            separationVector (0 0 -1);
            matchTolerance  1e-4;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;
        patches (auto1);
    }

    {
        // Name of new patch
        name walls;

        // Dictionary to construct new patch from
        patchInfo
        {
            type wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;
        patches (auto2 auto3);
    }

    {
        // Name of new patch
        name inlet;

        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;
        patches (auto4);
    }

    {
        // Name of new patch
        name outlet;

        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;
        patches (auto5);
    }

);

// ************************************************************************* //
