tests/ChannelAMI/system/fvSolution
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

SIMPLE
{
    consistent                         false;
    nNonOrthogonalCorrectors           0;
    residualControl
    {
        U                              1.000000e-20;
        nuTilda                        1.000000e-20;
        p                              1.000000e-20;
        e                              1.000000e-20;
        h                              1.000000e-20;
        p_rgh                          1.000000e-20;
        k                              1.000000e-20;
        omega                          1.000000e-20;
        epsilon                        1.000000e-20;
        T                              1.000000e-20;
        rho                            1.000000e-20;
    }
}

solvers
{
    "(U|T|e|h|nuTilda|k|omega|epsilon)"
    {
        relTol                         0.1;
        nSweeps                        1;
        solver                         smoothSolver;
        smoother                       GaussSeidel;
        maxIter                        1;
        minIter                        1;
        tolerance                      1e-20;
    }
    "(p|p_rgh)"
    {
        relTol                         0.1;
        nPreSweeps                     0;
        nCellsInCoarsestLevel          10;
        agglomerator                   faceAreaPair;
        maxIter                        2;
        minIter                        2;
        solver                         GAMG;
        tolerance                      1e-20;
        smoother                       GaussSeidel;
        cacheAgglomeration             true;
        mergeLevels                    1;
        nPostSweeps                    2;
    }
}

relaxationFactors
{
    fields
    {
        p                              0.30;
    }
    equations
    {
        U                              0.70;
        T                              0.70;
        nuTilda                        0.70;
        k                              0.70;
        omega                          0.70;
        epsilon                        0.70;
    }

}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
